/**
 **1.变量：用来存放数据，保存的数据可以修改
 **2.常量：用来存放数据，保存的数据不可以修改
 **3.两者的本质：本身都是数据，也要在内存中占用空间，保存在内存的栈结构分区中
 **4.ECMAScript标准定义了8种数据类型：7种原始数据类型（String,Number,Boolean,Undefined,,null,Symbol,BigInt）
                                **1种Object
 **5.引用数据类型：Object,Function,Array,Date,RegExp
 **6.typeof的返回值：String,Number,Boolean,Undefined,Object,Function
                  **特殊的两个：null和array的结果都是Object
 **7.instanceof运算符：原生JS判断实例的类型，用来判断当前实例对象是不是某种数据类型(obj instanceof 类型)
 **8.基本数据类型和引用数据类型在内存中,内存空间是如何存储数据的
 **9.除 Object 以外的所有类型都是不可变的（值本身无法被改变）,JavaScript 中字符串是不可变的
          **(注：如，JavaScript中对字符串的操作一定返回了一个新字符串，原始字符串并没有被改变)我们称这些类型的值为“原始值”。
  **10.基本数据类型的值在栈空间中存储,如果修改了数据,则是把原来的值直接干掉,重新存放新的值
  **11.引用数据类型的对象在堆空间中存储,该空间的地址在栈空间中存储,如果修改栈空间存储的地址,则指向发生变化,也叫引用发生了变化,此时是在堆空间中重新指向了一个新的内存空间(存储了一个新的对象)

  **12.基本类型之间的值如何传递? 传递的是数值
  **13.引用类型之间的值如何传递? 传递的是引用(地址)
 */